<h1 style="color: red; text-align: center; font-family: Arial, sans-serif; font-size: 32px;">
  Creation of Data frame
</h1>

In [3]:
#import pandas library
import pandas as pd

In [9]:
#creating data frame 
df=pd.DataFrame([[10,14,23,32],[23,13,21,34],[23,31,24,17]],
columns=["CD","DBMS","CAO","DSS"])

In [10]:
df

   CD  DBMS  CAO  DSS
0  10    14   23   32
1  23    13   21   34
2  23    31   24   17

In [11]:
df.shape

(3, 4)

In [12]:
df.size

12

In [15]:
df.ndim

2

In [30]:
df2=pd.DataFrame([[5,6,7,8]],
columns=["CD","CAO","DBMS","DSS"])

In [40]:
df3 = pd.concat([df, df2], ignore_index=True)

In [41]:
df3

   CD  DBMS  CAO  DSS
0  10    14   23   32
1  23    13   21   34
2  23    31   24   17
3   5     7    6    8

In [45]:
df3["DM"]=[12,15,16,14]

In [46]:
df3

   CD  DBMS  CAO  DSS  DM
0  10    14   23   32  12
1  23    13   21   34  15
2  23    31   24   17  16
3   5     7    6    8  14

In [47]:
df4=df3.drop(index=[1])

In [48]:
df4

   CD  DBMS  CAO  DSS  DM
0  10    14   23   32  12
2  23    31   24   17  16
3   5     7    6    8  14

In [51]:
df5=df3.drop(columns=["DM"])

In [52]:
df5

   CD  DBMS  CAO  DSS
0  10    14   23   32
1  23    13   21   34
2  23    31   24   17
3   5     7    6    8

In [55]:
#Finding mean of Dss
print("Mean of Dss",df5["DSS"].mean())

Mean of Dss 22.75

In [57]:
#Finding mode of Dss
print("Mode of Dss",df5["DSS"].mode())

Mode of Dss 0     8
1    17
2    32
3    34
Name: DSS, dtype: int64

In [58]:
#Finding median of Dss
print("Median of Dss",df5["DSS"].median())

Median of Dss 24.5

In [59]:
#Finding min of Dss
print("Min of Dss",df5["DSS"].min())

Min of Dss 8

In [60]:
#Finding max of Dss
print("Max of Dss",df5["DSS"].max())

Max of Dss 34

In [61]:
#Create a Student name list
Name=["Kartik","Harshal","Ram","Shrihari"]
Name

['Kartik', 'Harshal', 'Ram', 'Shrihari']

In [62]:
#Creating a series 
Roll_listed=pd.Series(Name,index=[1,2,3,4])

In [63]:
print(Roll_listed)

1      Kartik
2     Harshal
3         Ram
4    Shrihari
dtype: object